nxp-appcodehub/dm-lvgl-epaper-smartlabel-kw45/k32w148evk_wireless_uart_epaper_freertos/drivers/fsl_cmc.h
/*
 * Copyright 2019 ~ 2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#ifndef _FSL_CMC_H_
#define _FSL_CMC_H_
#include "fsl_common.h"

/*!
 * @addtogroup cmc
 * @{
 */
/*******************************************************************************
 * Definitions
 ******************************************************************************/
/*! @name Driver version */
/*@{*/
/*! @brief CMC driver version 2.2.1. */
#define FSL_CMC_DRIVER_VERSION (MAKE_VERSION(2, 2, 1))
/* @} */

/*!
 * @brief CMC power mode Protection enumeration.
 */
enum _cmc_power_mode_protection
{
    kCMC_AllowSleepMode         = 0x1UL, /*!< Allow Sleep mode. */
    kCMC_AllowDeepSleepMode     = 0x2UL, /*!< Allow Deep Sleep mode. */
    kCMC_AllowPowerDownMode     = 0x4UL, /*!< Allow Power Down mode. */
    kCMC_AllowDeepPowerDownMode = 0x8UL, /*!< Allow Deep Power Down mode. */
    kCMC_AllowAllLowPowerModes  = 0xFUL, /*!< Allow all low power modes. */
};

/*!
 * @brief Wake up sources from the previous low power mode entry.
 */
enum _cmc_wakeup_sources
{
    kCMC_WakeupFromResetInterruptOrPowerDown =
        CMC_CKSTAT_WAKEUP(1U << 0U), /*!< Wakeup source is reset interrupt, or wake up from [Deep] Power Down. */
    kCMC_WakeupFromDebugReuqest = CMC_CKSTAT_WAKEUP(1U << 1U), /*!< Wakeup source is debug request. */
    kCMC_WakeupFromInterrupt    = CMC_CKSTAT_WAKEUP(1U << 2U), /*!< Wakeup source is interrupt. */
    kCMC_WakeupFromDMAWakeup    = CMC_CKSTAT_WAKEUP(1U << 3U), /*!< Wakeup source is DMA Wakeup. */
    kCMC_WakeupFromWUURequest   = CMC_CKSTAT_WAKEUP(1U << 4U), /*!< Wakeup source is WUU request. */
    kCMC_WakeupFromBusMaster    = CMC_CKSTAT_WAKEUP(1U << 5U), /*!< Wakeup source is Bus master. */
};

/*!
 * @brief System Reset Interrupt enable enumeration.
 */
enum _cmc_system_reset_interrupt_enable
{
    kCMC_PinResetInterruptEnable = CMC_SRIE_PIN_MASK, /*!< Pin Reset interrupt enable. */
    kCMC_DAPResetInterruptEnable = CMC_SRIE_DAP_MASK, /*!< DAP Reset interrupt enable. */
    kCMC_LowPowerAcknowledgeTimeoutResetInterruptEnable =
        CMC_SRIE_LPACK_MASK, /*!< Low Power Acknowledge Timeout Reset interrupt enable. */
    kCMC_Watchdog0ResetInterruptEnable = CMC_SRIE_WDOG0_MASK,  /*!< Watchdog 0 Reset interrupt enable. */
    kCMC_SoftwareResetInterruptEnable  = CMC_SRIE_SW_MASK,     /*!< Software Reset interrupt enable. */
    kCMC_LockupResetInterruptEnable    = CMC_SRIE_LOCKUP_MASK, /*!< Lockup Reset interrupt enable. */
    kCMC_Watchdog1ResetInterruptEnable = CMC_SRIE_WDOG1_MASK,  /*!< Watchdog 1 Reset interrupt enable*/
};

/*!
 * @brief CMC System Reset Interrupt Status flag.
 */
enum _cmc_system_reset_interrupt_flag
{
    kCMC_PinResetInterruptFlag = CMC_SRIF_PIN_MASK, /*!< Pin Reset interrupt flag. */
    kCMC_DAPResetInterruptFlag = CMC_SRIF_DAP_MASK, /*!< DAP Reset interrupt flag. */
    kCMC_LowPowerAcknowledgeTimeoutResetFlag =
        CMC_SRIF_LPACK_MASK,                                /*!< Low Power Acknowledge Timeout Reset interrupt flag.  */
    kCMC_Watchdog0ResetInterruptFlag = CMC_SRIF_WDOG0_MASK, /*!< Watchdog 0 Reset interrupt flag. */
    kCMC_SoftwareResetInterruptFlag  = CMC_SRIF_SW_MASK,    /*!< Software Reset interrupt flag. */
    kCMC_LockupResetInterruptFlag    = CMC_SRIF_LOCKUP_MASK, /*!< Lock up Reset interrupt flag. */
    kCMC_Watchdog1ResetInterruptFlag = CMC_SRIF_WDOG1_MASK,  /*!< Watchdog 1 Reset interrupt flag. */
};

/*!
 * @brief CMC System SRAM arrays low power mode enable enumeration.
 */
enum _cmc_system_sram_arrays
{
    kCMC_SRAMBank0 = 1U << 0U, /*!< Power off SRAM Bank0,
                               please refer to chip's RM for the corresponding SRAM array. */
    kCMC_SRAMBank1 = 1U << 1U, /*!< Power off SRAM Bank1,
                               please refer to chip's RM for the corresponding SRAM array. */
    kCMC_SRAMBank2 = 1U << 2U, /*!< Power off SRAM Bank2,
                               please refer to chip's RM for the corresponding SRAM array. */
    kCMC_SRAMBank3 = 1U << 3U, /*!< Power off SRAM Bank3,
                               please refer to chip's RM for the corresponding SRAM array. */
    kCMC_SRAMBank4 = 1U << 4U, /*!< Power off SRAM Bank4,
                               please refer to chip's RM for the corresponding SRAM array. */
    kCMC_SRAMBank5 = 1U << 5U, /*!< Power off SRAM Bank5,
                               please refer to chip's RM for the corresponding SRAM array. */
    kCMC_SRAMBank6 = 1U << 6U, /*!< Power off SRAM Bank6,
                               please refer to chip's RM for the corresponding SRAM array. */
    kCMC_SRAMBank7 = 1U << 7U, /*!< Power off SRAM Bank7,
                               please refer to chip's RM for the corresponding SRAM array. */
};

/*!
 * @brief System reset sources enumeration.
 */
enum _cmc_system_reset_sources
{
    kCMC_WakeUpReset =
        CMC_SRS_WAKEUP_MASK,               /*!< The reset caused by a wakeup from Power Down or Deep Power Down mode. */
    kCMC_PORReset     = CMC_SRS_POR_MASK,  /*!< The reset caused by power on reset detection logic. */
    kCMC_LVDReset     = CMC_SRS_LVD_MASK,  /*!< The reset caused by a Low Voltage Detect. */
    kCMC_HVDReset     = CMC_SRS_HVD_MASK,  /*!< The reset caused by a High voltage Detect. */
    kCMC_WarmReset    = CMC_SRS_WARM_MASK, /*!< The last reset source is a warm reset source. */
    kCMC_FatalReset   = CMC_SRS_FATAL_MASK,  /*!< The last reset source is a fatal reset source. */
    kCMC_PinReset     = CMC_SRS_PIN_MASK,    /*!< The reset caused by the RESET_b pin. */
    kCMC_DAPReset     = CMC_SRS_DAP_MASK,    /*!< The reset caused by a reset request from the Debug Access port. */
    kCMC_ResetTimeout = CMC_SRS_RSTACK_MASK, /*!< The reset caused by a timeout or other error condition in the system
                                                reset generation. */
    kCMC_LowPowerAcknowledgeTimeoutReset =
        CMC_SRS_LPACK_MASK,           /*!< The reset caused by a timeout in low power mode entry logic. */
    kCMC_SCGReset = CMC_SRS_SCG_MASK, /*!< The reset caused by a loss of clock or loss of lock event in the SCG. */
    kCMC_Watchdog0Reset = CMC_SRS_WDOG0_MASK,  /*!< The reset caused by a WatchDog 0 timeout. */
    kCMC_SoftwareReset  = CMC_SRS_SW_MASK,     /*!< The reset caused by a software reset request. */
    kCMC_LockUoReset    = CMC_SRS_LOCKUP_MASK, /*!< The reset caused by the ARM core indication of a LOCKUP event. */
    kCMC_Watchdog1Reset = CMC_SRS_WDOG1_MASK,  /*!< The reset caused by a WatchDog 1 timeout. */
#if (defined(FSL_FEATURE_CMC_SRS_HAS_JTAG) && FSL_FEATURE_CMC_SRS_HAS_JTAG)
    kCMC_JTAGSystemReset = CMC_SRS_JTAG_MASK, /*!< The reset caused by a JTAG system reset request. */
#endif /* (defined(FSL_FEATURE_CMC_SRS_HAS_JTAG) && FSL_FEATURE_CMC_SRS_HAS_JTAG) */
    kCMC_SecurityViolationReset = CMC_SRS_SECVIO_MASK, /*!< The reset caused by a Security Violation logic. */
};

/*!
 * @brief Indicate the core clock was gated.
 */
typedef enum _cmc_core_clock_gate_status
{
    kCMC_CoreClockNotGated = 0U, /*!< Core clock not gated. */
    kCMC_CoreClockGated    = 1U  /*!< Core clock was gated due to low power mode entry. */
} cmc_core_clock_gate_status_t;

/*!
 * @brief CMC clock mode enumeration.
 */
typedef enum _cmc_clock_mode
{
    kCMC_GateNoneClock         = 0x00U, /*!< No clock gating. */
    kCMC_GateCoreClock         = 0x01U, /*!< Gate Core clock. */
    kCMC_GateCorePlatformClock = 0x03U, /*!< Gate Core clock and platform clock. */
    kCMC_GateAllSystemClocks = 0x07U, /*!< Gate all System clocks, without getting core entering into low power mode. */
    kCMC_GateAllSystemClocksEnterLowPowerMode =
        0x0FU /*!< Gate all System clocks, with core entering into low power mode. */
} cmc_clock_mode_t;

/*!
 * @brief CMC power mode enumeration.
 */
typedef enum _cmc_low_power_mode
{
    kCMC_ActiveMode    = 0x0U, /*!< Select Active mode. */
    kCMC_SleepMode     = 0x1U, /*!< Select Sleep mode when a core executes WFI or WFE instruction. */
    kCMC_DeepSleepMode = 0x3U, /*!< Select Deep Sleep mode when a core executes WFI or WFE instruction. */
    kCMC_PowerDownMode = 0x7U, /*!< Select Power Down mode when a core executes WFI or WFE instruction. */
    kCMC_DeepPowerDown = 0xFU, /*!< Select Deep Power Down mode when a core executes WFI or WFE instruction. */
} cmc_low_power_mode_t;

#if !(defined(FSL_FEATURE_CMC_HAS_NO_SRAMCTL_REGISTER) && FSL_FEATURE_CMC_HAS_NO_SRAMCTL_REGISTER)
/*!
 * @brief CMC SRAM Voltage Select Assist enumeration.
 */
typedef enum _cmc_sram_voltage_select_assist
{
    kCMC_VoltageSelectAssist0 = CMC_SRAMCTL_VSA(0x0U), /*!< SRAM configured for 0.9V operation. */
    kCMC_VoltageSelectAssist1 = CMC_SRAMCTL_VSA(0x1U), /*!< SRAM configured for 1.0V operation. */
    kCMC_VoltageSelectAssist2 = CMC_SRAMCTL_VSA(0x2U), /*!< SRAM configured for 1.1V operation. */
    kCMC_VoltageSelectAssist3 = CMC_SRAMCTL_VSA(0x3U), /*!< SRAM configured for 1.15V operation. */
} cmc_sram_voltage_select_assist_t;
#endif /* FSL_FEATURE_CMC_HAS_NO_SRAMCTL_REGISTER */

#if !(defined(FSL_FEATURE_CMC_HAS_NO_SRAMCTL_REGISTER) && FSL_FEATURE_CMC_HAS_NO_SRAMCTL_REGISTER)
/*!
 * @brief CMC SRAM Voltage Select Margin enumeration.
 */
typedef enum _cmc_sram_voltage_select_margin
{
    kCMC_VoltageSelectMargin0 = CMC_SRAMCTL_VSM(0x0U), /*!< SRAM configured for 0.9V operation. */
    kCMC_VoltageSelectMargin1 = CMC_SRAMCTL_VSM(0x1U), /*!< SRAM configured for 1.0V operation. */
    kCMC_VoltageSelectMargin2 = CMC_SRAMCTL_VSM(0x2U), /*!< SRAM configured for 1.1V operation. */
    kCMC_VoltageSelectMargin3 = CMC_SRAMCTL_VSM(0x3U), /*!< SRAM configured for 1.15V operation. */
} cmc_sram_voltage_select_margin_t;
#endif /* FSL_FEATURE_CMC_HAS_NO_SRAMCTL_REGISTER */

/*!
 * @brief CMC reset pin configuration.
 */
typedef struct _cmc_reset_pin_config
{
    bool lowpowerFilterEnable; /*!< Low Power Filter enable. */
    bool resetFilterEnable;    /*!< Reset Filter enable.  */
    uint8_t resetFilterWidth;  /*!< Width of the Reset Filter. */
} cmc_reset_pin_config_t;

#if !(defined(FSL_FEATURE_CMC_HAS_NO_SRAMCTL_REGISTER) && FSL_FEATURE_CMC_HAS_NO_SRAMCTL_REGISTER)
/*!
 * @brief System arrays voltage configuration.
 */
typedef struct _cmc_sram_voltage_config
{
    cmc_sram_voltage_select_margin_t margin; /*!< Voltage Select Margin. */
    cmc_sram_voltage_select_assist_t assist; /*!< Voltage Select Assist. */
} cmc_sram_voltage_config;
#endif /* FSL_FEATURE_CMC_HAS_NO_SRAMCTL_REGISTER */

/*!
 * @brief power mode configuration for each power domain.
 */
typedef struct _cmc_power_domain_config
{
    cmc_clock_mode_t clock_mode;      /*!< Clock mode for each power domain. */
    cmc_low_power_mode_t main_domain; /*!< The low power mode of the MAIN power domain. */
    cmc_low_power_mode_t wake_domain; /*!< The low power mode of the WAKE power domain. */
} cmc_power_domain_config_t;

